{
  "_name_or_path": "beomi/kcbert-base",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.2,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.2,
  "hidden_size": 768,
  "id2label": {
    "0": "\uae30\uc068",
    "1": "\ubd84\ub178",
    "2": "\ub180\ub78c",
    "3": "\uc2ac\ud514",
    "4": "\uc911\ub9bd"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\uae30\uc068": 0,
    "\ub180\ub78c": 2,
    "\ubd84\ub178": 1,
    "\uc2ac\ud514": 3,
    "\uc911\ub9bd": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 300,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30000
}
